unitTests/Foam2Eigen/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
9
(
(0.5627519  0.29181145 0.28462197 0.57400058 0.4035641  0.77061236 0.70690672 0.74452486 0.62652557)
(0.69557811 0.06141166 0.47935036 0.77075943 0.81715622 0.49681256 0.89278688 0.86556539 0.87408196)
(0.7669962  0.34741633 0.03897115 0.7084794  0.69924475 0.97304192 0.62685379 0.20484854 0.03407128)
(0.34010845 0.32642773 0.96446465 0.8921832  0.96303873 0.72409701 0.76203081 0.32020959 0.90977821)
(0.05821342 0.19182089 0.766128   0.3673941  0.00136123 0.78987992 0.43909767 0.60476928 0.65546178)
(0.42241117 0.10171041 0.4869757  0.28613934 0.14843946 0.91206661 0.81983309 0.82441992 0.9805341 )
(0.89249965 0.62821434 0.87326178 0.18050006 0.23324646 0.3946645  0.20235204 0.41437868 0.01136425)
(0.18654547 0.19546352 0.49102678 0.19965476 0.72438439 0.98217826 0.53671787 0.24718701 0.55385028)
(0.02552712 0.58269207 0.07486959 0.56967971 0.91339065 0.93712675 0.86183445 0.50107396 0.88059432)
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 0 1 0 0);
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
